// База данных параметров ссылок

////////////////////////////////////////////////////////

// Аполлон-16. Автострада места посадки
let links = [];

// p - позиция по горизонтали, по вертикали, ширина, высота, если круг, то вместо ширины и высоты, радиус
links[0] =
{
    "shape": "circle",
    "alt": "Аполлон-16. Джон Янг салютует флагу США в прыжке",
    "href": "https://youtu.be/7UjMDdXLozo",    // (12-46сек) Аполлон-16. Джон Янг салютует флагу США в прыжке
    "target": "_blank",
    "color": "#b10f0f",
    "markers": 
    [
        { t: 12, p: [526, 248, 16] },
        { t: 15.5, p: [456, 258, 16] },
        { t: 17.5, p: [415, 282, 16] },

        { t: 20, p: [388, 350, 18] },
        { t: 22, p: [388, 392, 19] },
        { t: 23.5, p: [413, 430, 21] },

        { t: 25, p: [465, 455, 23] },
        { t: 27, p: [523, 457, 25] },
        { t: 29, p: [543, 459, 27] },

        { t: 33, p: [485, 451, 27] },
        { t: 41, p: [485, 451, 26] },
        { t: 43, p: [492, 419, 26] },

        { t: 43.8, p: [534, 395, 25] },
        { t: 44.5, p: [599, 388, 25] },
        { t: 45.1, p: [654, 393, 25] },

        { t: 45.5, p: [719, 401, 25] },
        { t: 45.9, p: [775, 411, 25] },
        { t: 46.5, p: [890, 430, 25] }
    ]
};

links[1] =
{
    "shape": "circle",
    "alt": "Аполлон-16. На лунном вездеходе до станции 4",
    "href": "https://youtu.be/bTQ-SmeLTl8",   // (97-110сек) Аполлон-16. На лунном вездеходе до станции 4
    "target": "_blank",
    "color": "#b10f0f",
    "markers": 
    [
        { t: 96.7, p: [839, 186, 20] },
        { t: 97.8, p: [756, 187, 20] },
        { t: 98.4, p: [712, 186, 20] },

        { t: 98.9, p: [670, 187, 20] },
        { t: 101.5, p: [630, 186, 19] },
        { t: 103.6, p: [635, 179, 18] },

        { t: 106.6, p: [702, 170, 18] },
        { t: 111.0, p: [841, 161, 18] }
    ]
};

links[2] =
{
    "shape": "circle",
    "alt": "Аполлон-16. Cтанция 8 (геологическая). Астронавты Чарли Дьюк и Джон Янг",
    "href": "https://youtu.be/3ubICa4Dp70",   // (103-110сек) Аполлон-16. Cтанция 8 (геологическая). Астронавты Чарли Дьюк и Джон Янг
    "target": "_blank",
    "color": "#b10f0f",
    "markers": 
    [
        { t: 102.7, p: [520, 538, 28] },
        { t: 104.2, p: [587, 483, 28] },
        { t: 105.7, p: [664, 444, 28] },

        { t: 107.2, p: [741, 412, 28] },
        { t: 108.6, p: [809, 389, 28] },
        { t: 109.6, p: [862, 378, 28] }
    ]
};

links[3] =
{
    "shape": "circle",
    "alt": "Аполлон 16. Гран-при лунного вездехода",
    "href": "https://youtu.be/X30z82aeSHw",   //(119-131сек) Аполлон 16. Гран-при лунного вездехода
    "target": "_blank",
    "color": "#b10f0f",
    "markers": 
    [
        { t: 118.7, p: [117, 396, 26] },
        { t: 119.4, p: [218, 404, 26] },
        { t: 119.6, p: [255, 408, 26] },

        { t: 119.9, p: [300, 405, 26] },
        { t: 120.0, p: [326, 411, 26] },
        { t: 120.4, p: [373, 414, 26] },

        { t: 121.0, p: [436, 417, 26] },
        { t: 121.9, p: [474, 421, 26] },
        { t: 127.3, p: [485, 424, 26] },
        
        { t: 128.5, p: [529, 431, 26] },
        { t: 129.9, p: [678, 462, 27] },
        { t: 130.3, p: [750, 481, 27] },

        { t: 130.5, p: [787, 491, 27] },
        { t: 130.8, p: [840, 509, 27] },
        { t: 131.0, p: [910, 529, 28] }
    ]
};

////////////////////////////////////////////////////////